wsgi/tornado/tsung.xml
<?xml version="1.0"?>
<tsung loglevel="warning">
    <clients>
        <client host="localhost" use_controller_vm="false" maxusers="800"/>
    </clients>

    <servers>
        <server host="localhost" port="8080" type="tcp"/>
    </servers>

    <monitoring>
        <monitor host="localhost" type="erlang"/>
    </monitoring>

    <load>
        <arrivalphase phase="1" duration="5" unit="minute">
            <users interarrival="0.002" unit="second"/>
        </arrivalphase>
    </load>

    <sessions>
        <session name="wsgibench" probability="100" type="ts_http">
            <for from="0" to="12" incr="1" var="counter">
                <request>
                    <http url="http://localhost:8080/" version="1.1" method="GET"/>
                </request>
                <thinktime random="false" value="5"/>
            </for>
        </session>
    </sessions>
</tsung>